var searchData=
[
  ['подробно_20описание_20на_20примера_0',['Подробно описание на примера',['../de/d14/a00139.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d5/d4e/a00141.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['ползи_1',['Ползи',['../d6/db8/a00158.html#TEMPLATE_METHOD_BENEFITS',1,'']]],
  ['последици_2',['Последици',['../d6/db8/a00158.html#TEMPLATE_METHOD_CONSEQUENCES',1,'']]],
  ['приложимост_3',['Приложимост',['../d6/db8/a00158.html#TEMPLATE_METHOD_АPPLICABILITY',1,'']]],
  ['примерен_20код_4',['Примерен код',['../d2/df5/a00137.html#примерен-код',1,'']]],
  ['примери_5',['Примери',['../d6/db8/a00158.html#TEMPLATE_METHOD_EXAMPLES',1,'']]],
  ['пример_6',['Пример',['../d2/df5/a00137.html#пример',1,'Пример'],['../d4/ddd/a00138.html#ADAPTER_EXAMPLE',1,'Пример'],['../d5/db1/a00140.html#BRIDGE_EXAMPLE',1,'Пример'],['../d2/d82/a00142.html#COMMAND_EXAMPLE',1,'Пример'],['../d7/dce/a00143.html#COMPOSITE_EXAMPLE',1,'Пример'],['../d5/da7/a00144.html#DECORATOR_EXAMPLE',1,'Пример'],['../da/ddb/a00145.html#FACADE_EXAMPLE',1,'Пример'],['../d9/db6/a00146.html#FACTORY_METHOD_EXAMPLE',1,'Пример'],['../d0/d4a/a00147.html#FLYWEIGHT_EXAMPLE',1,'Пример'],['../db/d48/a00148.html#INTERPRETER_EXAMPLE',1,'Пример'],['../d3/d65/a00154.html#PROXY_EXAMPLE',1,'Пример'],['../d6/db8/a00158.html#TEMPLATE_METHOD_EXAMPLE',1,'Пример'],['../de/db9/a00159.html#VISITOR_EXAMPLE',1,'Пример']]],
  ['пример_20за_20builder_7',['Пример за Builder',['../de/d14/a00139.html#пример-за-builder',1,'']]],
  ['пример_20за_20chain_20of_20responsibility_3a_8',['Пример за Chain of Responsibility:',['../d5/d4e/a00141.html#пример-за-chain-of-responsibility',1,'']]],
  ['повече_20информация_9',['За повече информация',['../de/d14/a00139.html#BUILDER_REFERENCES',1,'']]],
  ['примера_10',['примера',['../de/d14/a00139.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d5/d4e/a00141.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['програмата_11',['Резултатът от изпълнението на програмата',['../d2/df5/a00137.html#резултатът-от-изпълнението-на-програмата',1,'']]]
];
