var searchData=
[
  ['недостатъци_0',['Недостатъци',['../de/d76/a00134.html#TEMPLATE_METHOD_DRAWBACKS',1,'']]],
  ['на_20класовете_1',['на класовете',['../df/d6a/a00119.html#COMPOSITE_CLASSDIAGRAM',1,'Диаграма на класовете'],['../df/dc8/a00122.html#FACTORY_METHOD_CLASS_DIAGRAM',1,'Диаграма на класовете'],['../de/d36/a00123.html#FLYWEIGHT_CLASSDIAGRAM',1,'Диаграма на класовете']]],
  ['на_20примера_2',['на примера',['../d2/da3/a00115.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d9/d4b/a00117.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['на_20програмата_3',['Резултатът от изпълнението на програмата',['../d3/d00/a00113.html#резултатът-от-изпълнението-на-програмата',1,'']]]
];
