var searchData=
[
  ['подробно_20описание_20на_20примера_0',['Подробно описание на примера',['../d2/da3/a00115.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d9/d4b/a00117.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['ползи_1',['Ползи',['../de/d76/a00134.html#TEMPLATE_METHOD_BENEFITS',1,'']]],
  ['последици_2',['Последици',['../de/d76/a00134.html#TEMPLATE_METHOD_CONSEQUENCES',1,'']]],
  ['приложимост_3',['Приложимост',['../de/d76/a00134.html#TEMPLATE_METHOD_АPPLICABILITY',1,'']]],
  ['примерен_20код_4',['Примерен код',['../d3/d00/a00113.html#примерен-код',1,'']]],
  ['примери_5',['Примери',['../de/d76/a00134.html#TEMPLATE_METHOD_EXAMPLES',1,'']]],
  ['пример_6',['Пример',['../d3/d00/a00113.html#пример',1,'Пример'],['../d8/d17/a00114.html#ADAPTER_EXAMPLE',1,'Пример'],['../d4/d3e/a00116.html#BRIDGE_EXAMPLE',1,'Пример'],['../d8/d87/a00118.html#COMMAND_EXAMPLE',1,'Пример'],['../df/d6a/a00119.html#COMPOSITE_EXAMPLE',1,'Пример'],['../d4/d98/a00120.html#DECORATOR_EXAMPLE',1,'Пример'],['../d8/dfa/a00121.html#FACADE_EXAMPLE',1,'Пример'],['../df/dc8/a00122.html#FACTORY_METHOD_EXAMPLE',1,'Пример'],['../de/d36/a00123.html#FLYWEIGHT_EXAMPLE',1,'Пример'],['../da/d72/a00124.html#INTERPRETER_EXAMPLE',1,'Пример'],['../d6/db3/a00130.html#PROXY_EXAMPLE',1,'Пример'],['../de/d76/a00134.html#TEMPLATE_METHOD_EXAMPLE',1,'Пример'],['../d5/d5b/a00135.html#VISITOR_EXAMPLE',1,'Пример']]],
  ['пример_20за_20builder_7',['Пример за Builder',['../d2/da3/a00115.html#пример-за-builder',1,'']]],
  ['пример_20за_20chain_20of_20responsibility_3a_8',['Пример за Chain of Responsibility:',['../d9/d4b/a00117.html#пример-за-chain-of-responsibility',1,'']]],
  ['повече_20информация_9',['За повече информация',['../d2/da3/a00115.html#BUILDER_REFERENCES',1,'']]],
  ['примера_10',['примера',['../d2/da3/a00115.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d9/d4b/a00117.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['програмата_11',['Резултатът от изпълнението на програмата',['../d3/d00/a00113.html#резултатът-от-изпълнението-на-програмата',1,'']]]
];
