var searchData=
[
  ['недостатъци_0',['Недостатъци',['../d6/db8/a00158.html#TEMPLATE_METHOD_DRAWBACKS',1,'']]],
  ['на_20класовете_1',['на класовете',['../d7/dce/a00143.html#COMPOSITE_CLASSDIAGRAM',1,'Диаграма на класовете'],['../d9/db6/a00146.html#FACTORY_METHOD_CLASS_DIAGRAM',1,'Диаграма на класовете'],['../d0/d4a/a00147.html#FLYWEIGHT_CLASSDIAGRAM',1,'Диаграма на класовете']]],
  ['на_20примера_2',['на примера',['../de/d14/a00139.html#подробно-описание-на-примера',1,'Подробно описание на примера'],['../d5/d4e/a00141.html#подробно-описание-на-примера-1',1,'Подробно описание на примера']]],
  ['на_20програмата_3',['Резултатът от изпълнението на програмата',['../d2/df5/a00137.html#резултатът-от-изпълнението-на-програмата',1,'']]]
];
